#+TITLE: Map Design
#+PROPERTIES:
 :Version: 0.01
 :Author: Corwin Brust
 :Created: 2020/01/11
 :END:

** Test Map
:PROPERTIES:
:NAME: regression-test-map-level
:END:

#+NAME: regression-test-map-level

This is a sample map used to develop and test the above.

 For each cell:

 * If the cell contains a reference follow it
 * With the cell referenced cell content giving X,Y and FEATURES:
   * Setting absolute position to given X,Y
   * Draw FEATURES sequentially
 * Add cell to list of "seen" cells.

NOTE: features must cooperate in terms of assumptions in terms of
relative position except for the first named feature.  No movement or
other instructions are added to the path between Features in the same
cell.

NOTE: This approach may only work when drawing the whole map.

TODO: write test, harness and document here

| X | Y | Features       | Documentation                   | Narrative |
|---+---+----------------+---------------------------------+-----------|
| 0 | 0 | m1,0 h-1 v1 h1 | 20x20 area with two exits west. |           |
| 3 | 0 | c-W            | Corridor ends.                  |           |
| 3 | 1 | c-W            | Corridor ends.                  |           |

Which should produce something similar to the following:

#+begin_src emacs-lisp :tangle design_org--test.svg
  (let ((svg (svg-create 400 400 :stroke-width 10)))
    (dom-append-child svg
		      (dom-node 'path
				'((d . "h300,v200,h-300,v-200,m0,-100,v200")
				  (stroke . "black")
				  (stroke-weight . 3))))
    ;;(svg-gradient svg "gradient1" 'linear '((0 . "red") (100 . "blue")))
    ;;(svg-circle svg 200 200 100 :gradient "gradient1" :stroke-color "green")
    (with-temp-buffer
      (svg-print svg)
      (buffer-string)))
#+end_src

#+RESULTS:
: <svg width="400" height="400" version="1.1" xmlns="http://www.w3.org/2000/svg" stroke-width="10"> <path d="h300,v200,h-300,v-200,m0,-100,v200" stroke="black" stroke-weight="3"></path></svg>

#+begin_src text
  +-------+
  |       |
  |  A  --|
  |       |
  +-------+
#+end_src
